kcuzner/teensy-oscilloscope/scope-teensy/include/MKM33Z5.h
/* PORT - Peripheral instance base addresses */
/** Peripheral PORTA base pointer */
#define PORTA_BASE_PTR                           ((PORT_MemMapPtr)0x40046000u)
/** Peripheral PORTB base pointer */
#define PORTB_BASE_PTR                           ((PORT_MemMapPtr)0x40047000u)
/** Peripheral PORTC base pointer */
#define PORTC_BASE_PTR                           ((PORT_MemMapPtr)0x40048000u)
/** Peripheral PORTD base pointer */
#define PORTD_BASE_PTR                           ((PORT_MemMapPtr)0x40049000u)
/** Peripheral PORTE base pointer */
#define PORTE_BASE_PTR                           ((PORT_MemMapPtr)0x4004A000u)
/** Peripheral PORTF base pointer */
#define PORTF_BASE_PTR                           ((PORT_MemMapPtr)0x4004B000u)
/** Peripheral PORTG base pointer */
#define PORTG_BASE_PTR                           ((PORT_MemMapPtr)0x4004C000u)
/** Peripheral PORTH base pointer */
#define PORTH_BASE_PTR                           ((PORT_MemMapPtr)0x4004D000u)
/** Peripheral PORTI base pointer */
#define PORTI_BASE_PTR                           ((PORT_MemMapPtr)0x4004E000u)
/** Array initializer of PORT peripheral base pointers */
#define PORT_BASE_PTRS                           { PORTA_BASE_PTR, PORTB_BASE_PTR, PORTC_BASE_PTR, PORTD_BASE_PTR, PORTE_BASE_PTR, PORTF_BASE_PTR, PORTG_BASE_PTR, PORTH_BASE_PTR, PORTI_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- PORT - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup PORT_Register_Accessor_Macros PORT - Register accessor macros
 * @{
 */


/* PORT - Register instance definitions */
/* PORTA */
#define PORTA_PCR0                               PORT_PCR_REG(PORTA_BASE_PTR,0)
#define PORTA_PCR1                               PORT_PCR_REG(PORTA_BASE_PTR,1)
#define PORTA_PCR2                               PORT_PCR_REG(PORTA_BASE_PTR,2)
#define PORTA_PCR3                               PORT_PCR_REG(PORTA_BASE_PTR,3)
#define PORTA_PCR4                               PORT_PCR_REG(PORTA_BASE_PTR,4)
#define PORTA_PCR5                               PORT_PCR_REG(PORTA_BASE_PTR,5)
#define PORTA_PCR6                               PORT_PCR_REG(PORTA_BASE_PTR,6)
#define PORTA_PCR7                               PORT_PCR_REG(PORTA_BASE_PTR,7)
#define PORTA_GPCLR                              PORT_GPCLR_REG(PORTA_BASE_PTR)
#define PORTA_GPCHR                              PORT_GPCHR_REG(PORTA_BASE_PTR)
#define PORTA_ISFR                               PORT_ISFR_REG(PORTA_BASE_PTR)
#define PORTA_DFER                               PORT_DFER_REG(PORTA_BASE_PTR)
#define PORTA_DFCR                               PORT_DFCR_REG(PORTA_BASE_PTR)
#define PORTA_DFWR                               PORT_DFWR_REG(PORTA_BASE_PTR)
/* PORTB */
#define PORTB_PCR0                               PORT_PCR_REG(PORTB_BASE_PTR,0)
#define PORTB_PCR1                               PORT_PCR_REG(PORTB_BASE_PTR,1)
#define PORTB_PCR2                               PORT_PCR_REG(PORTB_BASE_PTR,2)
#define PORTB_PCR3                               PORT_PCR_REG(PORTB_BASE_PTR,3)
#define PORTB_PCR4                               PORT_PCR_REG(PORTB_BASE_PTR,4)
#define PORTB_PCR5                               PORT_PCR_REG(PORTB_BASE_PTR,5)
#define PORTB_PCR6                               PORT_PCR_REG(PORTB_BASE_PTR,6)
#define PORTB_PCR7                               PORT_PCR_REG(PORTB_BASE_PTR,7)
#define PORTB_GPCLR                              PORT_GPCLR_REG(PORTB_BASE_PTR)
#define PORTB_GPCHR                              PORT_GPCHR_REG(PORTB_BASE_PTR)
#define PORTB_ISFR                               PORT_ISFR_REG(PORTB_BASE_PTR)
#define PORTB_DFER                               PORT_DFER_REG(PORTB_BASE_PTR)
#define PORTB_DFCR                               PORT_DFCR_REG(PORTB_BASE_PTR)
#define PORTB_DFWR                               PORT_DFWR_REG(PORTB_BASE_PTR)
/* PORTC */
#define PORTC_PCR0                               PORT_PCR_REG(PORTC_BASE_PTR,0)
#define PORTC_PCR1                               PORT_PCR_REG(PORTC_BASE_PTR,1)
#define PORTC_PCR2                               PORT_PCR_REG(PORTC_BASE_PTR,2)
#define PORTC_PCR3                               PORT_PCR_REG(PORTC_BASE_PTR,3)
#define PORTC_PCR4                               PORT_PCR_REG(PORTC_BASE_PTR,4)
#define PORTC_PCR5                               PORT_PCR_REG(PORTC_BASE_PTR,5)
#define PORTC_PCR6                               PORT_PCR_REG(PORTC_BASE_PTR,6)
#define PORTC_PCR7                               PORT_PCR_REG(PORTC_BASE_PTR,7)
#define PORTC_GPCLR                              PORT_GPCLR_REG(PORTC_BASE_PTR)
#define PORTC_GPCHR                              PORT_GPCHR_REG(PORTC_BASE_PTR)
#define PORTC_ISFR                               PORT_ISFR_REG(PORTC_BASE_PTR)
#define PORTC_DFER                               PORT_DFER_REG(PORTC_BASE_PTR)
#define PORTC_DFCR                               PORT_DFCR_REG(PORTC_BASE_PTR)
#define PORTC_DFWR                               PORT_DFWR_REG(PORTC_BASE_PTR)
/* PORTD */
#define PORTD_PCR0                               PORT_PCR_REG(PORTD_BASE_PTR,0)
#define PORTD_PCR1                               PORT_PCR_REG(PORTD_BASE_PTR,1)
#define PORTD_PCR2                               PORT_PCR_REG(PORTD_BASE_PTR,2)
#define PORTD_PCR3                               PORT_PCR_REG(PORTD_BASE_PTR,3)
#define PORTD_PCR4                               PORT_PCR_REG(PORTD_BASE_PTR,4)
#define PORTD_PCR5                               PORT_PCR_REG(PORTD_BASE_PTR,5)
#define PORTD_PCR6                               PORT_PCR_REG(PORTD_BASE_PTR,6)
#define PORTD_PCR7                               PORT_PCR_REG(PORTD_BASE_PTR,7)
#define PORTD_GPCLR                              PORT_GPCLR_REG(PORTD_BASE_PTR)
#define PORTD_GPCHR                              PORT_GPCHR_REG(PORTD_BASE_PTR)
#define PORTD_ISFR                               PORT_ISFR_REG(PORTD_BASE_PTR)
#define PORTD_DFER                               PORT_DFER_REG(PORTD_BASE_PTR)
#define PORTD_DFCR                               PORT_DFCR_REG(PORTD_BASE_PTR)
#define PORTD_DFWR                               PORT_DFWR_REG(PORTD_BASE_PTR)
/* PORTE */
#define PORTE_PCR0                               PORT_PCR_REG(PORTE_BASE_PTR,0)
#define PORTE_PCR1                               PORT_PCR_REG(PORTE_BASE_PTR,1)
#define PORTE_PCR2                               PORT_PCR_REG(PORTE_BASE_PTR,2)
#define PORTE_PCR3                               PORT_PCR_REG(PORTE_BASE_PTR,3)
#define PORTE_PCR4                               PORT_PCR_REG(PORTE_BASE_PTR,4)
#define PORTE_PCR5                               PORT_PCR_REG(PORTE_BASE_PTR,5)
#define PORTE_PCR6                               PORT_PCR_REG(PORTE_BASE_PTR,6)
#define PORTE_PCR7                               PORT_PCR_REG(PORTE_BASE_PTR,7)
#define PORTE_GPCLR                              PORT_GPCLR_REG(PORTE_BASE_PTR)
#define PORTE_GPCHR                              PORT_GPCHR_REG(PORTE_BASE_PTR)
#define PORTE_ISFR                               PORT_ISFR_REG(PORTE_BASE_PTR)
#define PORTE_DFER                               PORT_DFER_REG(PORTE_BASE_PTR)
#define PORTE_DFCR                               PORT_DFCR_REG(PORTE_BASE_PTR)
#define PORTE_DFWR                               PORT_DFWR_REG(PORTE_BASE_PTR)
/* PORTF */
#define PORTF_PCR0                               PORT_PCR_REG(PORTF_BASE_PTR,0)
#define PORTF_PCR1                               PORT_PCR_REG(PORTF_BASE_PTR,1)
#define PORTF_PCR2                               PORT_PCR_REG(PORTF_BASE_PTR,2)
#define PORTF_PCR3                               PORT_PCR_REG(PORTF_BASE_PTR,3)
#define PORTF_PCR4                               PORT_PCR_REG(PORTF_BASE_PTR,4)
#define PORTF_PCR5                               PORT_PCR_REG(PORTF_BASE_PTR,5)
#define PORTF_PCR6                               PORT_PCR_REG(PORTF_BASE_PTR,6)
#define PORTF_PCR7                               PORT_PCR_REG(PORTF_BASE_PTR,7)
#define PORTF_GPCLR                              PORT_GPCLR_REG(PORTF_BASE_PTR)
#define PORTF_GPCHR                              PORT_GPCHR_REG(PORTF_BASE_PTR)
#define PORTF_ISFR                               PORT_ISFR_REG(PORTF_BASE_PTR)
#define PORTF_DFER                               PORT_DFER_REG(PORTF_BASE_PTR)
#define PORTF_DFCR                               PORT_DFCR_REG(PORTF_BASE_PTR)
#define PORTF_DFWR                               PORT_DFWR_REG(PORTF_BASE_PTR)
/* PORTG */
#define PORTG_PCR0                               PORT_PCR_REG(PORTG_BASE_PTR,0)
#define PORTG_PCR1                               PORT_PCR_REG(PORTG_BASE_PTR,1)
#define PORTG_PCR2                               PORT_PCR_REG(PORTG_BASE_PTR,2)
#define PORTG_PCR3                               PORT_PCR_REG(PORTG_BASE_PTR,3)
#define PORTG_PCR4                               PORT_PCR_REG(PORTG_BASE_PTR,4)
#define PORTG_PCR5                               PORT_PCR_REG(PORTG_BASE_PTR,5)
#define PORTG_PCR6                               PORT_PCR_REG(PORTG_BASE_PTR,6)
#define PORTG_PCR7                               PORT_PCR_REG(PORTG_BASE_PTR,7)
#define PORTG_GPCLR                              PORT_GPCLR_REG(PORTG_BASE_PTR)
#define PORTG_GPCHR                              PORT_GPCHR_REG(PORTG_BASE_PTR)
#define PORTG_ISFR                               PORT_ISFR_REG(PORTG_BASE_PTR)
#define PORTG_DFER                               PORT_DFER_REG(PORTG_BASE_PTR)
#define PORTG_DFCR                               PORT_DFCR_REG(PORTG_BASE_PTR)
#define PORTG_DFWR                               PORT_DFWR_REG(PORTG_BASE_PTR)
/* PORTH */
#define PORTH_PCR0                               PORT_PCR_REG(PORTH_BASE_PTR,0)
#define PORTH_PCR1                               PORT_PCR_REG(PORTH_BASE_PTR,1)
#define PORTH_PCR2                               PORT_PCR_REG(PORTH_BASE_PTR,2)
#define PORTH_PCR3                               PORT_PCR_REG(PORTH_BASE_PTR,3)
#define PORTH_PCR4                               PORT_PCR_REG(PORTH_BASE_PTR,4)
#define PORTH_PCR5                               PORT_PCR_REG(PORTH_BASE_PTR,5)
#define PORTH_PCR6                               PORT_PCR_REG(PORTH_BASE_PTR,6)
#define PORTH_PCR7                               PORT_PCR_REG(PORTH_BASE_PTR,7)
#define PORTH_GPCLR                              PORT_GPCLR_REG(PORTH_BASE_PTR)
#define PORTH_GPCHR                              PORT_GPCHR_REG(PORTH_BASE_PTR)
#define PORTH_ISFR                               PORT_ISFR_REG(PORTH_BASE_PTR)
#define PORTH_DFER                               PORT_DFER_REG(PORTH_BASE_PTR)
#define PORTH_DFCR                               PORT_DFCR_REG(PORTH_BASE_PTR)
#define PORTH_DFWR                               PORT_DFWR_REG(PORTH_BASE_PTR)
/* PORTI */
#define PORTI_PCR0                               PORT_PCR_REG(PORTI_BASE_PTR,0)
#define PORTI_PCR1                               PORT_PCR_REG(PORTI_BASE_PTR,1)
#define PORTI_PCR2                               PORT_PCR_REG(PORTI_BASE_PTR,2)
#define PORTI_PCR3                               PORT_PCR_REG(PORTI_BASE_PTR,3)
#define PORTI_PCR4                               PORT_PCR_REG(PORTI_BASE_PTR,4)
#define PORTI_PCR5                               PORT_PCR_REG(PORTI_BASE_PTR,5)
#define PORTI_PCR6                               PORT_PCR_REG(PORTI_BASE_PTR,6)
#define PORTI_PCR7                               PORT_PCR_REG(PORTI_BASE_PTR,7)
#define PORTI_GPCLR                              PORT_GPCLR_REG(PORTI_BASE_PTR)
#define PORTI_GPCHR                              PORT_GPCHR_REG(PORTI_BASE_PTR)
#define PORTI_ISFR                               PORT_ISFR_REG(PORTI_BASE_PTR)
#define PORTI_DFER                               PORT_DFER_REG(PORTI_BASE_PTR)
#define PORTI_DFCR                               PORT_DFCR_REG(PORTI_BASE_PTR)
#define PORTI_DFWR                               PORT_DFWR_REG(PORTI_BASE_PTR)

