kcuzner/teensy-oscilloscope/scope-teensy/include/MKM33Z5.h
/** TMR - Peripheral register structure */
typedef struct TMR_MemMap {
  uint16_t COMP1;                                  /**< Timer Channel Compare Register 1, offset: 0x0 */
  uint16_t COMP2;                                  /**< Timer Channel Compare Register 2, offset: 0x2 */
  uint16_t CAPT;                                   /**< Timer Channel Capture Register, offset: 0x4 */
  uint16_t LOAD;                                   /**< Timer Channel Load Register, offset: 0x6 */
  uint16_t HOLD;                                   /**< Timer Channel Hold Register, offset: 0x8 */
  uint16_t CNTR;                                   /**< Timer Channel Counter Register, offset: 0xA */
  uint16_t CTRL;                                   /**< Timer Channel Control Register, offset: 0xC */
  uint16_t SCTRL;                                  /**< Timer Channel Status and Control Register, offset: 0xE */
  uint16_t CMPLD1;                                 /**< Timer Channel Comparator Load Register 1, offset: 0x10 */
  uint16_t CMPLD2;                                 /**< Timer Channel Comparator Load Register 2, offset: 0x12 */
  uint16_t CSCTRL;                                 /**< Timer Channel Comparator Status and Control Register, offset: 0x14 */
  uint16_t FILT;                                   /**< Timer Channel Input Filter Register, offset: 0x16 */
  uint16_t DMA;                                    /**< Timer Channel DMA Enable Register, offset: 0x18 */
  uint8_t RESERVED_0[4];
  uint16_t ENBL;                                   /**< Timer Channel Enable Register, offset: 0x1E */
} volatile *TMR_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- TMR - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup TMR_Register_Accessor_Macros TMR - Register accessor macros
 * @{
 */


/* TMR - Register accessors */
#define TMR_COMP1_REG(base)                      ((base)->COMP1)
#define TMR_COMP2_REG(base)                      ((base)->COMP2)
#define TMR_CAPT_REG(base)                       ((base)->CAPT)
#define TMR_LOAD_REG(base)                       ((base)->LOAD)
#define TMR_HOLD_REG(base)                       ((base)->HOLD)
#define TMR_CNTR_REG(base)                       ((base)->CNTR)
#define TMR_CTRL_REG(base)                       ((base)->CTRL)
#define TMR_SCTRL_REG(base)                      ((base)->SCTRL)
#define TMR_CMPLD1_REG(base)                     ((base)->CMPLD1)
#define TMR_CMPLD2_REG(base)                     ((base)->CMPLD2)
#define TMR_CSCTRL_REG(base)                     ((base)->CSCTRL)
#define TMR_FILT_REG(base)                       ((base)->FILT)
#define TMR_DMA_REG(base)                        ((base)->DMA)
#define TMR_ENBL_REG(base)                       ((base)->ENBL)

/**
 * @}
 */ /* end of group TMR_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- TMR Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup TMR_Register_Masks TMR Register Masks
 * @{
 */

/* COMP1 Bit Fields */
#define TMR_COMP1_COMPARISON_1_MASK              0xFFFFu
#define TMR_COMP1_COMPARISON_1_SHIFT             0
#define TMR_COMP1_COMPARISON_1(x)                (((uint16_t)(((uint16_t)(x))<<TMR_COMP1_COMPARISON_1_SHIFT))&TMR_COMP1_COMPARISON_1_MASK)
/* COMP2 Bit Fields */
#define TMR_COMP2_COMPARISON_2_MASK              0xFFFFu
#define TMR_COMP2_COMPARISON_2_SHIFT             0
#define TMR_COMP2_COMPARISON_2(x)                (((uint16_t)(((uint16_t)(x))<<TMR_COMP2_COMPARISON_2_SHIFT))&TMR_COMP2_COMPARISON_2_MASK)
/* CAPT Bit Fields */
#define TMR_CAPT_CAPTURE_MASK                    0xFFFFu
#define TMR_CAPT_CAPTURE_SHIFT                   0
#define TMR_CAPT_CAPTURE(x)                      (((uint16_t)(((uint16_t)(x))<<TMR_CAPT_CAPTURE_SHIFT))&TMR_CAPT_CAPTURE_MASK)
/* LOAD Bit Fields */
#define TMR_LOAD_LOAD_MASK                       0xFFFFu
#define TMR_LOAD_LOAD_SHIFT                      0
#define TMR_LOAD_LOAD(x)                         (((uint16_t)(((uint16_t)(x))<<TMR_LOAD_LOAD_SHIFT))&TMR_LOAD_LOAD_MASK)
/* HOLD Bit Fields */
#define TMR_HOLD_HOLD_MASK                       0xFFFFu
#define TMR_HOLD_HOLD_SHIFT                      0
#define TMR_HOLD_HOLD(x)                         (((uint16_t)(((uint16_t)(x))<<TMR_HOLD_HOLD_SHIFT))&TMR_HOLD_HOLD_MASK)
/* CNTR Bit Fields */
#define TMR_CNTR_COUNTER_MASK                    0xFFFFu
#define TMR_CNTR_COUNTER_SHIFT                   0
#define TMR_CNTR_COUNTER(x)                      (((uint16_t)(((uint16_t)(x))<<TMR_CNTR_COUNTER_SHIFT))&TMR_CNTR_COUNTER_MASK)
/* CTRL Bit Fields */
#define TMR_CTRL_OUTMODE_MASK                    0x7u
#define TMR_CTRL_OUTMODE_SHIFT                   0
#define TMR_CTRL_OUTMODE(x)                      (((uint16_t)(((uint16_t)(x))<<TMR_CTRL_OUTMODE_SHIFT))&TMR_CTRL_OUTMODE_MASK)
#define TMR_CTRL_COINIT_MASK                     0x8u
#define TMR_CTRL_COINIT_SHIFT                    3
#define TMR_CTRL_DIR_MASK                        0x10u
#define TMR_CTRL_DIR_SHIFT                       4
#define TMR_CTRL_LENGTH_MASK                     0x20u
#define TMR_CTRL_LENGTH_SHIFT                    5
#define TMR_CTRL_ONCE_MASK                       0x40u
#define TMR_CTRL_ONCE_SHIFT                      6
#define TMR_CTRL_SCS_MASK                        0x180u
#define TMR_CTRL_SCS_SHIFT                       7
#define TMR_CTRL_SCS(x)                          (((uint16_t)(((uint16_t)(x))<<TMR_CTRL_SCS_SHIFT))&TMR_CTRL_SCS_MASK)
#define TMR_CTRL_PCS_MASK                        0x1E00u
#define TMR_CTRL_PCS_SHIFT                       9
#define TMR_CTRL_PCS(x)                          (((uint16_t)(((uint16_t)(x))<<TMR_CTRL_PCS_SHIFT))&TMR_CTRL_PCS_MASK)
#define TMR_CTRL_CM_MASK                         0xE000u
#define TMR_CTRL_CM_SHIFT                        13
#define TMR_CTRL_CM(x)                           (((uint16_t)(((uint16_t)(x))<<TMR_CTRL_CM_SHIFT))&TMR_CTRL_CM_MASK)
/* SCTRL Bit Fields */
#define TMR_SCTRL_OEN_MASK                       0x1u
#define TMR_SCTRL_OEN_SHIFT                      0
#define TMR_SCTRL_OPS_MASK                       0x2u
#define TMR_SCTRL_OPS_SHIFT                      1
#define TMR_SCTRL_FORCE_MASK                     0x4u
#define TMR_SCTRL_FORCE_SHIFT                    2
#define TMR_SCTRL_VAL_MASK                       0x8u
#define TMR_SCTRL_VAL_SHIFT                      3
#define TMR_SCTRL_EEOF_MASK                      0x10u
#define TMR_SCTRL_EEOF_SHIFT                     4
#define TMR_SCTRL_MSTR_MASK                      0x20u
#define TMR_SCTRL_MSTR_SHIFT                     5
#define TMR_SCTRL_CAPTURE_MODE_MASK              0xC0u
#define TMR_SCTRL_CAPTURE_MODE_SHIFT             6
#define TMR_SCTRL_CAPTURE_MODE(x)                (((uint16_t)(((uint16_t)(x))<<TMR_SCTRL_CAPTURE_MODE_SHIFT))&TMR_SCTRL_CAPTURE_MODE_MASK)
#define TMR_SCTRL_INPUT_MASK                     0x100u
#define TMR_SCTRL_INPUT_SHIFT                    8
#define TMR_SCTRL_IPS_MASK                       0x200u
#define TMR_SCTRL_IPS_SHIFT                      9
#define TMR_SCTRL_IEFIE_MASK                     0x400u
#define TMR_SCTRL_IEFIE_SHIFT                    10
#define TMR_SCTRL_IEF_MASK                       0x800u
#define TMR_SCTRL_IEF_SHIFT                      11
#define TMR_SCTRL_TOFIE_MASK                     0x1000u
#define TMR_SCTRL_TOFIE_SHIFT                    12
#define TMR_SCTRL_TOF_MASK                       0x2000u
#define TMR_SCTRL_TOF_SHIFT                      13
#define TMR_SCTRL_TCFIE_MASK                     0x4000u
#define TMR_SCTRL_TCFIE_SHIFT                    14
#define TMR_SCTRL_TCF_MASK                       0x8000u
#define TMR_SCTRL_TCF_SHIFT                      15
/* CMPLD1 Bit Fields */
#define TMR_CMPLD1_COMPARATOR_LOAD_1_MASK        0xFFFFu
#define TMR_CMPLD1_COMPARATOR_LOAD_1_SHIFT       0
#define TMR_CMPLD1_COMPARATOR_LOAD_1(x)          (((uint16_t)(((uint16_t)(x))<<TMR_CMPLD1_COMPARATOR_LOAD_1_SHIFT))&TMR_CMPLD1_COMPARATOR_LOAD_1_MASK)
/* CMPLD2 Bit Fields */
#define TMR_CMPLD2_COMPARATOR_LOAD_2_MASK        0xFFFFu
#define TMR_CMPLD2_COMPARATOR_LOAD_2_SHIFT       0
#define TMR_CMPLD2_COMPARATOR_LOAD_2(x)          (((uint16_t)(((uint16_t)(x))<<TMR_CMPLD2_COMPARATOR_LOAD_2_SHIFT))&TMR_CMPLD2_COMPARATOR_LOAD_2_MASK)
/* CSCTRL Bit Fields */
#define TMR_CSCTRL_CL1_MASK                      0x3u
#define TMR_CSCTRL_CL1_SHIFT                     0
#define TMR_CSCTRL_CL1(x)                        (((uint16_t)(((uint16_t)(x))<<TMR_CSCTRL_CL1_SHIFT))&TMR_CSCTRL_CL1_MASK)
#define TMR_CSCTRL_CL2_MASK                      0xCu
#define TMR_CSCTRL_CL2_SHIFT                     2
#define TMR_CSCTRL_CL2(x)                        (((uint16_t)(((uint16_t)(x))<<TMR_CSCTRL_CL2_SHIFT))&TMR_CSCTRL_CL2_MASK)
#define TMR_CSCTRL_TCF1_MASK                     0x10u
#define TMR_CSCTRL_TCF1_SHIFT                    4
#define TMR_CSCTRL_TCF2_MASK                     0x20u
#define TMR_CSCTRL_TCF2_SHIFT                    5
#define TMR_CSCTRL_TCF1EN_MASK                   0x40u
#define TMR_CSCTRL_TCF1EN_SHIFT                  6
#define TMR_CSCTRL_TCF2EN_MASK                   0x80u
#define TMR_CSCTRL_TCF2EN_SHIFT                  7
#define TMR_CSCTRL_UP_MASK                       0x200u
#define TMR_CSCTRL_UP_SHIFT                      9
#define TMR_CSCTRL_TCI_MASK                      0x400u
#define TMR_CSCTRL_TCI_SHIFT                     10
#define TMR_CSCTRL_ROC_MASK                      0x800u
#define TMR_CSCTRL_ROC_SHIFT                     11
#define TMR_CSCTRL_ALT_LOAD_MASK                 0x1000u
#define TMR_CSCTRL_ALT_LOAD_SHIFT                12
#define TMR_CSCTRL_FAULT_MASK                    0x2000u
#define TMR_CSCTRL_FAULT_SHIFT                   13
#define TMR_CSCTRL_DBG_EN_MASK                   0xC000u
#define TMR_CSCTRL_DBG_EN_SHIFT                  14
#define TMR_CSCTRL_DBG_EN(x)                     (((uint16_t)(((uint16_t)(x))<<TMR_CSCTRL_DBG_EN_SHIFT))&TMR_CSCTRL_DBG_EN_MASK)
/* FILT Bit Fields */
#define TMR_FILT_FILT_PER_MASK                   0xFFu
#define TMR_FILT_FILT_PER_SHIFT                  0
#define TMR_FILT_FILT_PER(x)                     (((uint16_t)(((uint16_t)(x))<<TMR_FILT_FILT_PER_SHIFT))&TMR_FILT_FILT_PER_MASK)
#define TMR_FILT_FILT_CNT_MASK                   0x700u
#define TMR_FILT_FILT_CNT_SHIFT                  8
#define TMR_FILT_FILT_CNT(x)                     (((uint16_t)(((uint16_t)(x))<<TMR_FILT_FILT_CNT_SHIFT))&TMR_FILT_FILT_CNT_MASK)
/* DMA Bit Fields */
#define TMR_DMA_IEFDE_MASK                       0x1u
#define TMR_DMA_IEFDE_SHIFT                      0
#define TMR_DMA_CMPLD1DE_MASK                    0x2u
#define TMR_DMA_CMPLD1DE_SHIFT                   1
#define TMR_DMA_CMPLD2DE_MASK                    0x4u
#define TMR_DMA_CMPLD2DE_SHIFT                   2
/* ENBL Bit Fields */
#define TMR_ENBL_ENBL_MASK                       0xFu
#define TMR_ENBL_ENBL_SHIFT                      0
#define TMR_ENBL_ENBL(x)                         (((uint16_t)(((uint16_t)(x))<<TMR_ENBL_ENBL_SHIFT))&TMR_ENBL_ENBL_MASK)

/**
 * @}
 */ /* end of group TMR_Register_Masks */


/* TMR - Peripheral instance base addresses */
/** Peripheral TMR0 base pointer */
#define TMR0_BASE_PTR                            ((TMR_MemMapPtr)0x40057000u)
/** Peripheral TMR1 base pointer */
#define TMR1_BASE_PTR                            ((TMR_MemMapPtr)0x40058000u)
/** Peripheral TMR2 base pointer */
#define TMR2_BASE_PTR                            ((TMR_MemMapPtr)0x40059000u)
/** Peripheral TMR3 base pointer */
#define TMR3_BASE_PTR                            ((TMR_MemMapPtr)0x4005A000u)
/** Array initializer of TMR peripheral base pointers */
#define TMR_BASE_PTRS                            { TMR0_BASE_PTR, TMR1_BASE_PTR, TMR2_BASE_PTR, TMR3_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- TMR - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup TMR_Register_Accessor_Macros TMR - Register accessor macros
 * @{
 */


/* TMR - Register instance definitions */
/* TMR0 */
#define TMR0_COMP1                               TMR_COMP1_REG(TMR0_BASE_PTR)
#define TMR0_COMP2                               TMR_COMP2_REG(TMR0_BASE_PTR)
#define TMR0_CAPT                                TMR_CAPT_REG(TMR0_BASE_PTR)
#define TMR0_LOAD                                TMR_LOAD_REG(TMR0_BASE_PTR)
#define TMR0_HOLD                                TMR_HOLD_REG(TMR0_BASE_PTR)
#define TMR0_CNTR                                TMR_CNTR_REG(TMR0_BASE_PTR)
#define TMR0_CTRL                                TMR_CTRL_REG(TMR0_BASE_PTR)
#define TMR0_SCTRL                               TMR_SCTRL_REG(TMR0_BASE_PTR)
#define TMR0_CMPLD1                              TMR_CMPLD1_REG(TMR0_BASE_PTR)
#define TMR0_CMPLD2                              TMR_CMPLD2_REG(TMR0_BASE_PTR)
#define TMR0_CSCTRL                              TMR_CSCTRL_REG(TMR0_BASE_PTR)
#define TMR0_FILT                                TMR_FILT_REG(TMR0_BASE_PTR)
#define TMR0_DMA                                 TMR_DMA_REG(TMR0_BASE_PTR)
#define TMR0_ENBL                                TMR_ENBL_REG(TMR0_BASE_PTR)
/* TMR1 */
#define TMR1_COMP1                               TMR_COMP1_REG(TMR1_BASE_PTR)
#define TMR1_COMP2                               TMR_COMP2_REG(TMR1_BASE_PTR)
#define TMR1_CAPT                                TMR_CAPT_REG(TMR1_BASE_PTR)
#define TMR1_LOAD                                TMR_LOAD_REG(TMR1_BASE_PTR)
#define TMR1_HOLD                                TMR_HOLD_REG(TMR1_BASE_PTR)
#define TMR1_CNTR                                TMR_CNTR_REG(TMR1_BASE_PTR)
#define TMR1_CTRL                                TMR_CTRL_REG(TMR1_BASE_PTR)
#define TMR1_SCTRL                               TMR_SCTRL_REG(TMR1_BASE_PTR)
#define TMR1_CMPLD1                              TMR_CMPLD1_REG(TMR1_BASE_PTR)
#define TMR1_CMPLD2                              TMR_CMPLD2_REG(TMR1_BASE_PTR)
#define TMR1_CSCTRL                              TMR_CSCTRL_REG(TMR1_BASE_PTR)
#define TMR1_FILT                                TMR_FILT_REG(TMR1_BASE_PTR)
#define TMR1_DMA                                 TMR_DMA_REG(TMR1_BASE_PTR)
#define TMR1_ENBL                                TMR_ENBL_REG(TMR1_BASE_PTR)
/* TMR2 */
#define TMR2_COMP1                               TMR_COMP1_REG(TMR2_BASE_PTR)
#define TMR2_COMP2                               TMR_COMP2_REG(TMR2_BASE_PTR)
#define TMR2_CAPT                                TMR_CAPT_REG(TMR2_BASE_PTR)
#define TMR2_LOAD                                TMR_LOAD_REG(TMR2_BASE_PTR)
#define TMR2_HOLD                                TMR_HOLD_REG(TMR2_BASE_PTR)
#define TMR2_CNTR                                TMR_CNTR_REG(TMR2_BASE_PTR)
#define TMR2_CTRL                                TMR_CTRL_REG(TMR2_BASE_PTR)
#define TMR2_SCTRL                               TMR_SCTRL_REG(TMR2_BASE_PTR)
#define TMR2_CMPLD1                              TMR_CMPLD1_REG(TMR2_BASE_PTR)
#define TMR2_CMPLD2                              TMR_CMPLD2_REG(TMR2_BASE_PTR)
#define TMR2_CSCTRL                              TMR_CSCTRL_REG(TMR2_BASE_PTR)
#define TMR2_FILT                                TMR_FILT_REG(TMR2_BASE_PTR)
#define TMR2_DMA                                 TMR_DMA_REG(TMR2_BASE_PTR)
#define TMR2_ENBL                                TMR_ENBL_REG(TMR2_BASE_PTR)
/* TMR3 */
#define TMR3_COMP1                               TMR_COMP1_REG(TMR3_BASE_PTR)
#define TMR3_COMP2                               TMR_COMP2_REG(TMR3_BASE_PTR)
#define TMR3_CAPT                                TMR_CAPT_REG(TMR3_BASE_PTR)
#define TMR3_LOAD                                TMR_LOAD_REG(TMR3_BASE_PTR)
#define TMR3_HOLD                                TMR_HOLD_REG(TMR3_BASE_PTR)
#define TMR3_CNTR                                TMR_CNTR_REG(TMR3_BASE_PTR)
#define TMR3_CTRL                                TMR_CTRL_REG(TMR3_BASE_PTR)
#define TMR3_SCTRL                               TMR_SCTRL_REG(TMR3_BASE_PTR)
#define TMR3_CMPLD1                              TMR_CMPLD1_REG(TMR3_BASE_PTR)
#define TMR3_CMPLD2                              TMR_CMPLD2_REG(TMR3_BASE_PTR)
#define TMR3_CSCTRL                              TMR_CSCTRL_REG(TMR3_BASE_PTR)
#define TMR3_FILT                                TMR_FILT_REG(TMR3_BASE_PTR)
#define TMR3_DMA                                 TMR_DMA_REG(TMR3_BASE_PTR)
#define TMR3_ENBL                                TMR_ENBL_REG(TMR3_BASE_PTR)

/**
 * @}
 */ /* end of group TMR_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group TMR_Peripheral */


/* ----------------------------------------------------------------------------
   -- UART
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup UART_Peripheral UART
 * @{
 */

/** UART - Peripheral register structure */
typedef struct UART_MemMap {
  uint8_t BDH;                                     /**< UART Baud Rate Registers: High, offset: 0x0 */
  uint8_t BDL;                                     /**< UART Baud Rate Registers: Low, offset: 0x1 */
  uint8_t C1;                                      /**< UART Control Register 1, offset: 0x2 */
  uint8_t C2;                                      /**< UART Control Register 2, offset: 0x3 */
  uint8_t S1;                                      /**< UART Status Register 1, offset: 0x4 */
  uint8_t S2;                                      /**< UART Status Register 2, offset: 0x5 */
  uint8_t C3;                                      /**< UART Control Register 3, offset: 0x6 */
  uint8_t D;                                       /**< UART Data Register, offset: 0x7 */
  uint8_t MA1;                                     /**< UART Match Address Registers 1, offset: 0x8 */
  uint8_t MA2;                                     /**< UART Match Address Registers 2, offset: 0x9 */
  uint8_t C4;                                      /**< UART Control Register 4, offset: 0xA */
  uint8_t C5;                                      /**< UART Control Register 5, offset: 0xB */
  uint8_t ED;                                      /**< UART Extended Data Register, offset: 0xC */
  uint8_t MODEM;                                   /**< UART Modem Register, offset: 0xD */
  uint8_t RESERVED_0[2];
  uint8_t PFIFO;                                   /**< UART FIFO Parameters, offset: 0x10 */
  uint8_t CFIFO;                                   /**< UART FIFO Control Register, offset: 0x11 */
  uint8_t SFIFO;                                   /**< UART FIFO Status Register, offset: 0x12 */
  uint8_t TWFIFO;                                  /**< UART FIFO Transmit Watermark, offset: 0x13 */
  uint8_t TCFIFO;                                  /**< UART FIFO Transmit Count, offset: 0x14 */
  uint8_t RWFIFO;                                  /**< UART FIFO Receive Watermark, offset: 0x15 */
  uint8_t RCFIFO;                                  /**< UART FIFO Receive Count, offset: 0x16 */
  uint8_t RESERVED_1[1];
  uint8_t C7816;                                   /**< UART 7816 Control Register, offset: 0x18 */
  uint8_t IE7816;                                  /**< UART 7816 Interrupt Enable Register, offset: 0x19 */
  uint8_t IS7816;                                  /**< UART 7816 Interrupt Status Register, offset: 0x1A */
  union {                                          /* offset: 0x1B */
    uint8_t WP7816_T_TYPE0;                          /**< UART 7816 Wait Parameter Register, offset: 0x1B */
    uint8_t WP7816_T_TYPE1;                          /**< UART 7816 Wait Parameter Register, offset: 0x1B */
  };
  uint8_t WN7816;                                  /**< UART 7816 Wait N Register, offset: 0x1C */
  uint8_t WF7816;                                  /**< UART 7816 Wait FD Register, offset: 0x1D */
  uint8_t ET7816;                                  /**< UART 7816 Error Threshold Register, offset: 0x1E */
  uint8_t TL7816;                                  /**< UART 7816 Transmit Length Register, offset: 0x1F */
} volatile *UART_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- UART - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup UART_Register_Accessor_Macros UART - Register accessor macros
 * @{
 */


/* UART - Register accessors */
#define UART_BDH_REG(base)                       ((base)->BDH)
#define UART_BDL_REG(base)                       ((base)->BDL)
#define UART_C1_REG(base)                        ((base)->C1)
#define UART_C2_REG(base)                        ((base)->C2)
#define UART_S1_REG(base)                        ((base)->S1)
#define UART_S2_REG(base)                        ((base)->S2)
#define UART_C3_REG(base)                        ((base)->C3)
#define UART_D_REG(base)                         ((base)->D)
#define UART_MA1_REG(base)                       ((base)->MA1)
#define UART_MA2_REG(base)                       ((base)->MA2)
#define UART_C4_REG(base)                        ((base)->C4)
#define UART_C5_REG(base)                        ((base)->C5)
#define UART_ED_REG(base)                        ((base)->ED)
#define UART_MODEM_REG(base)                     ((base)->MODEM)
#define UART_PFIFO_REG(base)                     ((base)->PFIFO)
#define UART_CFIFO_REG(base)                     ((base)->CFIFO)
#define UART_SFIFO_REG(base)                     ((base)->SFIFO)
#define UART_TWFIFO_REG(base)                    ((base)->TWFIFO)
#define UART_TCFIFO_REG(base)                    ((base)->TCFIFO)
#define UART_RWFIFO_REG(base)                    ((base)->RWFIFO)
#define UART_RCFIFO_REG(base)                    ((base)->RCFIFO)
#define UART_C7816_REG(base)                     ((base)->C7816)
#define UART_IE7816_REG(base)                    ((base)->IE7816)
#define UART_IS7816_REG(base)                    ((base)->IS7816)
#define UART_WP7816_T_TYPE0_REG(base)            ((base)->WP7816_T_TYPE0)
#define UART_WP7816_T_TYPE1_REG(base)            ((base)->WP7816_T_TYPE1)
#define UART_WN7816_REG(base)                    ((base)->WN7816)
#define UART_WF7816_REG(base)                    ((base)->WF7816)
#define UART_ET7816_REG(base)                    ((base)->ET7816)
#define UART_TL7816_REG(base)                    ((base)->TL7816)

/**
 * @}
 */ /* end of group UART_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- UART Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup UART_Register_Masks UART Register Masks
 * @{
 */

